Router>enable
Router#configure terminal
Router(config)#interface gig 0/0
Router(config-if)#ip address 192.168.0.1 255.255.255.0
Router(config-if)#no shutdown
Router(config)#interface gig 0/0
Router(config-if)#ip address 192.168.0.1 255.255.255.0
Router(config-if)#no shutdown
Router(config)#interface gig 0/1
Router(config-if)#ip address 193.168.0.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#interface gig 0/1/0
Router(config-if)#ip address 196.168.0.1 255.255.255.0
Router(config-if)#no sh
Router(config-if)#exit
Router(config)#do write
Router(config)#ip route 194.168.0.0 255.255.255.0 196.168.0.2
Router(config)#ip route 195.168.0.0 255.255.255.0 196.168.0.2
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#write

For 2nd Router
Router>en
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface gig 0/0
Router(config-if)#ip address 194.168.0.1 255.255.255.0
Router(config-if)#no sh
Router(config-if)#exit
Router(config)#do write
Router(config)#interface gig 0/1
Router(config-if)#ip address 195.168.0.1 255.255.255.0
Router(config-if)#no sh
Router(config-if)#exit
Router(config)#interface gig 0/1/0
Router(config-if)#ip address 196.168.0.2 255.255.255.0
Router(config-if)#no sh
Router(config-if)#exit
Router(config)#do write
Building configuration...
[OK]
Router(config)#ip route 192.168.0.0 255.255.255.0 196.168.0.1
Router(config)#ip route 193.168.0.0 255.255.255.0 196.168.0.1
Router(config)#exit
Router(config-if)#exit
Router(config)#do write
Building configuration...
[OK]
Router(config)#ip route 192.168.0.0 255.255.255.0 196.168.0.1
Router(config)#ip route 193.168.0.0 255.255.255.0 196.168.0.1
Router(config)#exit